import React, { useState } from 'react'
import './Blog.scss'

export default function Blog() {
    const [poets, setPoets] = useState([
        {
            id: 1,
            name: 'Պարույր Սևակ',
            body: 'Պարույր Սևակը դարձել է 1950-1960-ական թվականների հայ պոեզիայի առաջատար դեմքը, որն իր մեջ համատեղել է «հայ և համաշխարհային պոեզիայի նորարարական շունչը՝ որոնումն ուղղելով դեպի գրականության հավերժական Անհայտը, որը Մարդն է՝ իմանալի-բացահայտված, բայց առավել չափով անիմանալի-չբացահայտված՝ իր ոգեղեն անսպառ գոյությամբ»',
            img: 'https://granish.org//wp-content/uploads/2017/01/paruyr-sevak.jpg'
        },
        {
            id: 2,
            name: 'Եղիշե Չարենց',
            body: 'Չարենցը ծնվել է 1897 թվականին Կարսում։ «Արևելյան փոշոտ ու դեղին մի քաղաք, անկյանք փողոցներ, բերդ, Վարդանի կամուրջ, Առաքելոց եկեղեցի և հինգ հարկանի պաշտոնական մի շենք»,- այսպես է գրողը ներկայացնում իր ծննդավայրը։ Այս տխուր միջավայրը, սակայն, նրան տվել է ինչ-որ բան, ազդել մանուկ հոգու վրա։',
            img: 'https://www.usanogh.am/wp-content/uploads/2020/11/charents22.jpg'
        },
        {
            id: 3,
            name: 'Ակսել Բակունց',
            body: 'Ծնվել է 1899 թվականին հունիսի 13-ին Գորիսում։ Գորիսի ծխական դպրոցն ավարտելուց հետո Բակունցը 1910 թվականին ընդունվում է Էջմիածնի Գևորգյան ճեմարան, որի դասարանային բաժինն ավարտում է 1917 թվականին։ Հետագայում մանկավարժական աշխատանք է կատարում Զանգեզուրի Լոր գյուղում։',
            img: 'https://granish.org/wp-content/uploads/2023/06/bakunc-a-330x225.jpg'
        }
    ])
    return (
        <div className='Blog'>
            {
                poets.map(elem => {
                    return (
                        <div key={elem.id}>
                            <img src={elem.img} alt="" />
                            <ul><h1>{elem.name}</h1>
                                <p>{elem.body}</p></ul>
                        </div>
                    )
                })
            }
        </div>
    )
}
