import React from 'react'
import './Home.scss'

export default function Home() {
  return (
    <div className='Home'>
      <h1>Home page</h1>

       <div className="Home__content">
        <h1>React router dom <br /> <span>create</span>Web Site</h1>
      </div> 
      <section>
        <p>SmartCode ծրագրավորման ուսուցման ընկերությունը արդեն 8 տարի է կազմակերպում և իրականացնում է ծրագրավորման դասընթացներ, նպատակ ունենալով աշխատաշուկային հանձնել որակյալ մասնագետներ:

Հետևելով համաշխարհային IT թրենդներին՝ թարմացվում և կատարելագործվում են դասավանդման ծրագրերը: Հատուկ մշակված ծրագրի, տնային առաջադրանքների և անվճար փորձաշրջանի արդյունքում մեր ուսանողները գրանցում են մեծ հաջողություններ: Հմուտ մասնագետների աշխատանքի արդյունքում մենք վայելում ենք մեր ուսանողների սերն ու վստահությունը: Համագործակցելով IT ընկերությունների հետ՝ մենք Երաշխավորում ենք լավագույն ուսանողների փորձաշրջանն ու աշխատանքը:</p>
      </section>
    </div>
  )
}
